Adding Documentation.md
